InformationRegisters/ПаспортныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВнешниеКодыУслугКЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВнешниеКодыУслугКЛ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийАнализов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийАнализов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Забор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтметкаВыполненияИсследования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВСтороннююЛабораторию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРезультатовОтСтороннейЛаборатории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПробИзСтороннейЛаборатории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаРезультатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утеря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАнализа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОтправкиЗаказовНаИсследовние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОтправкиЗаказовНаИсследовние</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученЧастичныйРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЗаказовЛаборатории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказовЛаборатории</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаИсследованиеВнутренний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказНаИсследованиеВнутренний</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биоматериал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биоматериалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиЗаказовНаИсследовние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействияНадАнализами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебСервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияЗаказовЛаборатории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатИсследования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПробы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВебСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВебСервисы</Name>
			<Comment>1С.Клиническая лаборатория</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКВебСервису</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВзаимодействиеСЛИС/Ext/Module.bsl
#Область ОтправкаЗаказаНаИсследования // Отправка заказа в 1С:Клиническая лаборатория.

Процедура СформироватьЗаказыНаИсследованиеВнутренний() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаИсследованиеВнутреннийИсследования.Номенклатура КАК Номенклатура,
		|	ЗаказНаИсследованиеВнутреннийИсследования.Ссылка.ДокументОснование КАК ДокументОснование,
		|	ЗаказНаИсследованиеВнутреннийИсследования.Ссылка.Клиент КАК Клиент
		|ПОМЕСТИТЬ СозданныеЗаказыВЛИС
		|ИЗ
		|	Документ.ЗаказНаИсследованиеВнутренний.Исследования КАК ЗаказНаИсследованиеВнутреннийИсследования
		|ГДЕ
		|	ЗаказНаИсследованиеВнутреннийИсследования.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействияНадАнализамиИсследования.Ссылка КАК ДнА,
		|	ДействияНадАнализамиИсследования.Номенклатура КАК Номенклатура,
		|	ДействияНадАнализамиИсследования.Клиент КАК Клиент,
		|	ДействияНадАнализамиИсследования.ИД КАК ИД
		|ПОМЕСТИТЬ СозданныеЗаборы
		|ИЗ
		|	Документ.ДействияНадАнализами.Исследования КАК ДействияНадАнализамиИсследования
		|ГДЕ
		|	ДействияНадАнализамиИсследования.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийАнализов.Забор)
		|	И ДействияНадАнализамиИсследования.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И (ДействияНадАнализамиИсследования.Лаборатория = ЗНАЧЕНИЕ(Справочник.Лаборатории.ПустаяСсылка)
		|			ИЛИ ДействияНадАнализамиИсследования.Лаборатория.ВнешняяЛаборатория = ЗНАЧЕНИЕ(Перечисление.ВнешниеЛаборатории.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СозданныеЗаборы.Номенклатура КАК Номенклатура,
		|	СозданныеЗаборы.ДнА КАК ДнА,
		|	ЕСТЬNULL(СозданныеЗаказыВЛИС.ДокументОснование, ИСТИНА) КАК Новая,
		|	СозданныеЗаборы.Клиент КАК Клиент,
		|	СозданныеЗаборы.ИД КАК ИД
		|ПОМЕСТИТЬ Новые
		|ИЗ
		|	СозданныеЗаборы КАК СозданныеЗаборы
		|		ЛЕВОЕ СОЕДИНЕНИЕ СозданныеЗаказыВЛИС КАК СозданныеЗаказыВЛИС
		|		ПО СозданныеЗаборы.ДнА = СозданныеЗаказыВЛИС.ДокументОснование
		|			И СозданныеЗаборы.Номенклатура = СозданныеЗаказыВЛИС.Номенклатура
		|			И СозданныеЗаборы.Клиент = СозданныеЗаказыВЛИС.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Новые.Номенклатура КАК Номенклатура,
		|	Новые.ДнА КАК ДнА,
		|	Новые.ДнА.Филиал КАК ДнА_Филиал,
		|	Новые.Клиент КАК Клиент,
		|	Новые.ИД КАК ИД
		|ИЗ
		|	Новые КАК Новые
		|ГДЕ
		|	Новые.Новая = ИСТИНА
		|ИТОГИ ПО
		|	Клиент, ДнА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлиенты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); // Не удалять выборку по клиентам. (ДнА может имет 2 клиентов).
	Пока ВыборкаКлиенты.Следующий() Цикл
	
		ВыборкаДнА = ВыборкаКлиенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДнА.Следующий() Цикл
			
			ВыборкаАнализы = ВыборкаДнА.Выбрать();
			ВыборкаАнализы.Следующий();
			
			Заказ = Документы.ЗаказНаИсследованиеВнутренний.СоздатьДокумент();
			Заказ.Дата = ТекущаяДата();
			Заказ.ДокументОснование = ВыборкаАнализы.ДнА;
			Заказ.Клиент	 = ВыборкаАнализы.Клиент;
			Заказ.Филиал	 = ВыборкаАнализы.ДнА_Филиал;
			Заказ.Статус	 = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.Создан;
			Заказ.ВебСервис	 = ПолучитьВебСервис();
			
			ВыборкаАнализы.Сбросить();
			Пока ВыборкаАнализы.Следующий() Цикл
				Стр = Заказ.Исследования.Добавить();
				Стр.Номенклатура = ВыборкаАнализы.Номенклатура;
				Стр.Состояние	 = Перечисления.СостоянияЗаказовЛаборатории.Создан;
				Стр.ИД			 = ВыборкаАнализы.ИД;
			КонецЦикла;
			
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьЗаказыНаИсследованиеВнутренний() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаИсследованиеВнутренний.Ссылка
		|ИЗ
		|	Документ.ЗаказНаИсследованиеВнутренний КАК ЗаказНаИсследованиеВнутренний
		|ГДЕ
		|	ЗаказНаИсследованиеВнутренний.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказНаИсследованиеВнутренний.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиЗаказовНаИсследовние.Создан)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Результат = ВзаимодействиеСЛИС.ОтправитьЗаказНаСервере(ВыборкаДетальныеЗаписи.Ссылка);
		Если Лев(НРег(Результат),5) = "<soap" Тогда
			Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Для каждого Стр Из Объект.Исследования Цикл
				Стр.Состояние = Перечисления.СостоянияЗаказовЛаборатории.Отправлен;
			КонецЦикла; 		
			Объект.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.Отправлен;
			Объект.Записать();
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВебСервис()
	Пользователь = Пользователи.ТекущийПользователь();
	Филиал = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнойФилиал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВебСервисы.Ссылка
		|ИЗ
		|	Справочник.ВебСервисы КАК ВебСервисы
		|ГДЕ
		|	ВебСервисы.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОтправитьЗаказНаСервере(Объект) Экспорт
	
	Если Объект.ВебСервис = Справочники.ВебСервисы.ПустаяСсылка() Тогда
		Возврат "Не установлен веб-сервис";	
	КонецЕсли;
	
	Документ = Объект;
	УслугиТЗ = Новый ТаблицаЗначений;
	УслугиТЗ.Колонки.Добавить("УникальныйИдентификаторУслуги", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	
	Тип_ClinicalDocument = ФабрикаXDTO.Тип("urn:hl7-org:v3","POCD_MT000040.ClinicalDocument");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип_ClinicalDocument);
	
	ДанныеЗаполнения = Новый Массив;
	
	// Заполнение шапки
	
	СоздатьШапку(Документ, ДанныеЗаполнения, Неопределено);
	
	ДобавитьВМассив(ДанныеЗаполнения,"componentOf.encompassingEncounter.effectiveTime.@nullFlavor","NI");
	
	// Добавляем табличную часть услуги
	
	ДобавитьВМассив(ДанныеЗаполнения,"component.structuredBody.component.section.text.table.@border",1);
	ДобавитьВМассив(ДанныеЗаполнения,"component.structuredBody.component.section.text.table.thead.tr.th[0]","Код услуги");
	ДобавитьВМассив(ДанныеЗаполнения,"component.structuredBody.component.section.text.table.thead.tr.th[1]","Название услуги");
	ДобавитьВМассив(ДанныеЗаполнения,"component.structuredBody.component.section.text.table.thead.tr.th[2]","Дата взятия материала");
	ДобавитьВМассив(ДанныеЗаполнения,"component.structuredBody.component.section.text.table.thead.tr.th[3]","Комментарий");
	
	Сч = 1;	
	Для Каждого СтрокаНом Из Объект.Исследования Цикл 
		СоздатьПакетЗаказаЛабИсследования_ТЧ(ДанныеЗаполнения, Документ, СтрокаНом , Сч);
		НоваяСтрокаТЗ = УслугиТЗ.Добавить();
		НоваяСтрокаТЗ.УникальныйИдентификаторУслуги = СтрокаНом.Номенклатура.УникальныйИдентификатор();
		Сч = Сч + 1;
	КонецЦикла;
	
	
	ЗаполнитьОбъектXDTO(ОбъектXDTO, ДанныеЗаполнения);
	ПакетСериализованный = СтрЗаменить(СериализоватьОбъектXDTO(ОбъектXDTO),
	"POCD_MT000040.ClinicalDocument",
	"ClinicalDocument"
	);
	
	Пакет = СоздатьОбъект_RCMR_IN000002UV02(ПакетСериализованный);
	
	ПакетСериализованный = СериализоватьОбъектXDTO(Пакет);
	ЗаписьXML  = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Пакет);
	СтрокаXML = ЗаписьXML.Закрыть();
	
	КоличествоОтправленныхПакетов = 0;
	
	Результат = ПодготовитьПакет(Пакет, КоличествоОтправленныхПакетов,Объект.ВебСервис);
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьПакет(СтрокаXML, КоличествоОтправленныхПакетов, ВебСервис)
	
	Строка = СериализоватьОбъектXDTO(СтрокаXML);
	ПреобразованныйXML = ПреобразоватьXMLДляОтправки(Строка, СтрокаXML.Тип().Имя);
	БазовыйДокумент = 
	"<?xml version=""1.0"" encoding=""UTF-8""?>
	|<soap:Envelope xmlns:soap=""http://schemas.xmlsoap.org/soap/envelope/"">
	|	<soap:Header/>
	|	<soap:Body> 
	|	<m:ProcessHL7v3Message xmlns:m=""urn:hl7-org:v3"">" + 
	ПреобразованныйXML + "
	|	</m:ProcessHL7v3Message>
	|	</soap:Body>
	|</soap:Envelope>"
	;
	Если Лев(БазовыйДокумент, 1) = Символы.ПС Тогда 
		БазовыйДокумент = сред(БазовыйДокумент, 2);
	КонецЕсли;
	ИмяФайла = ПоместитьТекстВФайл(БазовыйДокумент, Неопределено, "UTF-8");
	
	Результат = ОтправитьФайлНаСервер(ИмяФайла, КоличествоОтправленныхПакетов, "Отправка сообщений в ЛИС",ВебСервис);
	Возврат Результат;
КонецФункции

Функция ПреобразоватьXMLДляОтправки(СтрокаXML, ИмяМетода)
	
	Префикс = "m:";
	
	СтрРез = СтрЗаменить(СтрокаXML, "<", "<" + Префикс);
	СтрРез = СтрЗаменить(СтрРез, "<" + Префикс + "/", "</" + Префикс);
	СтрРез = СтрЗаменить(СтрРез, "<" + Префикс + ИмяМетода, "<" + Префикс +"Message " +" xsi:type=""m:" + ИмяМетода + """");
	СтрРез = СтрЗаменить(СтрРез, "</" + Префикс + ИмяМетода, "</" + Префикс +"Message");
	
	СтрРез = СтрЗаменить(СтрРез, "<m:?xml version=""1.0"" encoding=""UTF-8""?>", "");
	Если Лев(СтрРез, 1) = Символы.ПС Тогда 
		СтрРез = сред(СтрРез, 2);
	КонецЕсли;
	
	Возврат СтрРез;
	
КонецФункции

Функция ПоместитьТекстВФайл(Данные, ИмяФайла = Неопределено, ТипФайла = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла();
	Иначе
		ИмяФайла = ИмяФайла;
	КонецЕсли;
	
	Документ = Новый ТекстовыйДокумент;
	Документ.УстановитьТекст(Данные);
	Документ.Записать(ИмяФайла, ТипФайла, Символы.ПС);
	
	Если ТипФайла = Неопределено Или ТипФайла = КодировкаТекста.UTF8 Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
		Строка64 = Base64Строка(ДвоичныеДанные);
		Строка64 = Прав(Строка64,СтрДлина(Строка64)-4);
		ДанныеНаЗапись = Base64Значение(Строка64);
		ДанныеНаЗапись.Записать(ИмяФайла);
	КонецЕсли;
	
	Возврат ИмяФайла;
КонецФункции

Функция ОтправитьФайлНаСервер(ИмяФайла, КоличествоОтправленныхПакетов, ЗаголовокЖурнала, ВебСервис) Экспорт
	
	Кодировка = "UTF-8";
	ФайлНазначение = ПолучитьИмяВременногоФайла();
	Соединение = Новый HTTPСоединение(ВебСервис.Адрес,ВебСервис.Порт,ВебСервис.Логин,ВебСервис.Пароль,,ВебСервис.Таймаут);
	Попытка
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", "text/xml; charset=UTF-8");
		Запрос = Новый HTTPЗапрос(ВебСервис.ПутьКВебСервису,ЗаголовокHTTP);
		Запрос.УстановитьИмяФайлаТела(ИмяФайла);
		Рез = Соединение.ОтправитьДляОбработки(Запрос,ФайлНазначение);
		
		Если Рез.КодСостояния = 200 Тогда
			Сообщить("Заказ успешно отправлен");			
		КонецЕсли;
		
		КоличествоОтправленныхПакетов = КоличествоОтправленныхПакетов + 1;
	Исключение
		Инф = ИнформацияОбОшибке();
		СообщениеОбОшибке = НСтр("ru='Не удалось отправить заказ по причине: %1'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(СообщениеОбОшибке, Инф.Причина.Описание));
	КонецПопытки;
	
	ТекстДокумент = Новый ТекстовыйДокумент;
	ТекстДокумент.Прочитать(ФайлНазначение, Кодировка);
	УдалитьФайлы(ФайлНазначение);
	
	Попытка
		УдалитьФайлы(ИмяФайла); 
	Исключение
	КонецПопытки;
	
	Результат = ТекстДокумент.ПолучитьТекст();
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьШапку(Документ, ДанныеЗаполнения, НазначившийВрач)
	
	ДобавитьВМассив(ДанныеЗаполнения,"typeId.@extension","POCD_HD000040");
	ДобавитьВМассив(ДанныеЗаполнения,"typeId.@root","2.16.840.1.113883.1.3");
	ДобавитьВМассив(ДанныеЗаполнения,"id.@root",Строка(Документ.Ссылка.УникальныйИдентификатор()));
	//	ДобавитьВМассив(ДанныеЗаполнения,"code",Неопределено);
	ДобавитьВМассив(ДанныеЗаполнения,"code.@code", "18610-6");
	ДобавитьВМассив(ДанныеЗаполнения,"code.@codeSystem", "2.16.840.1.113883.6.1");
	ДобавитьВМассив(ДанныеЗаполнения,"code.@codeSystemName", "LOINC");
	ДобавитьВМассив(ДанныеЗаполнения,"effectiveTime.@value", Формат(Документ.Дата, "ДФ=yyyyMMddHHmmss"));
	ДобавитьВМассив(ДанныеЗаполнения,"confidentialityCode.@code", "N");
	ДобавитьВМассив(ДанныеЗаполнения,"confidentialityCode.@codeSystem", "2.16.840.1.113883.5.25");
	ДобавитьВМассив(ДанныеЗаполнения,"confidentialityCode.@displayName", "Normal");
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.id.@root", Строка(Документ.Клиент.УникальныйИдентификатор()));
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.name[0].family", Документ.Клиент.Фамилия);
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.name[1].given[0]", Документ.Клиент.Имя);
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.name[1].given[1]", Документ.Клиент.Отчество);
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.name[1].family", Документ.Клиент.Фамилия);
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.administrativeGenderCode.@code", ПолучитьКодПола(Документ.Клиент.Пол));
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.administrativeGenderCode.@codeSystem","2.16.840.1.113883.5.1");
	ДобавитьВМассив(ДанныеЗаполнения,"recordTarget.patientRole.patient.birthTime.@value", Формат(Документ.Клиент.ДатаРождения, "ДФ=yyyyMMdd"));
	
	// Паспорт 
	ДанныеПаспорт = РегистрыСведений.ПаспортныеДанные.ПолучитьПоследнее(Документ.Дата, Новый Структура("ФизЛицо",Документ.Клиент));
	ИндексДУЛ = 1;
	Если ЗначениеЗаполнено(ДанныеПаспорт) 
		И ЗначениеЗаполнено(ДанныеПаспорт.ДокументСерия)
		И ЗначениеЗаполнено(ДанныеПаспорт.ДокументНомер) 
	Тогда
		СерияНомерДокумента = ИнтеграцияЕГИСЗСлужебныйСервер.УдалитьСимволыКроме(ДанныеПаспорт.ДокументСерия,"0123456789") + " " + ИнтеграцияЕГИСЗСлужебныйСервер.УдалитьСимволыКроме(ДанныеПаспорт.ДокументНомер,"0123456789"); 
		
		ДобавитьВМассив(ДанныеЗаполнения, "recordTarget.patientRole.id[" + Строка(ИндексДУЛ) + "].@root", "1.2.643.5.1.13.13.99.2.48.1");
		ДобавитьВМассив(ДанныеЗаполнения, "recordTarget.patientRole.id[" + Строка(ИндексДУЛ) + "].@extension", СерияНомерДокумента);
		
		КемВыдан = ДанныеПаспорт.ДокументКемВыдан + " " + "код подразделения:" + ДанныеПаспорт.ДокументКодПодразделения + " " + "дата выдачи:" + Формат(ДанныеПаспорт.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy");
		ДобавитьВМассив(ДанныеЗаполнения, "recordTarget.patientRole.id[" + Строка(ИндексДУЛ) + "].assigningAuthorityName", КемВыдан);
		
		ИндексДУЛ = ИндексДУЛ + 1;
	КонецЕсли;
	
	// СНИЛС
	Если ЗначениеЗаполнено(Документ.Клиент.СНИЛС) Тогда
		ДобавитьВМассив(ДанныеЗаполнения, "recordTarget.patientRole.id[" + Строка(ИндексДУЛ) + "].@root", "1.2.643.100.3");
		ДобавитьВМассив(ДанныеЗаполнения, "recordTarget.patientRole.id[" + Строка(ИндексДУЛ) + "].@extension", ИнтеграцияЕГИСЗСлужебныйСервер.УдалитьСимволыКроме(Документ.Клиент.СНИЛС,"0123456789"));
	КонецЕсли; 
	
	// Добавление контактной информации
	ДобавитьДынныеКИВШапку(Документ.Клиент,ДанныеЗаполнения);
	
	ДобавитьВМассив(ДанныеЗаполнения,"author.time.@value",Формат(Документ.Дата, "ДФ=yyyyMMddHHmmss"));
	Если ЗначениеЗаполнено(Документ.Врач) Тогда  
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.id.@root", Строка(Документ.Врач.УникальныйИдентификатор()));
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.prefix", Строка(""));
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.family", Документ.Врач.Фамилия);
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.given[0]",Документ.Врач.Имя);
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.given[1]", Документ.Врач.Отчество);	
	Иначе
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.id.@root", Строка(Справочники.Сотрудники.ПустаяСсылка()));
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.prefix", Строка(""));
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.family", "");
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.given[0]","");
		ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.assignedPerson.name.given[1]", "");
	КонецЕсли;
	ДобавитьВМассив(ДанныеЗаполнения,"custodian.assignedCustodian.representedCustodianOrganization.name",Строка(Документ.Филиал.Наименование));
	ДобавитьВМассив(ДанныеЗаполнения,"custodian.assignedCustodian.representedCustodianOrganization.id.@root",
	Строка(Документ.Филиал.УникальныйИдентификатор()));
	ДобавитьВМассив(ДанныеЗаполнения,"author.assignedAuthor.representedOrganization.id.@root",
	Строка(Документ.Филиал.УникальныйИдентификатор()));
	
КонецПроцедуры

Процедура ДобавитьДынныеКИВШапку(Клиент, ДанныеЗаполнения)
	Префикс = "recordTarget.patientRole.telecom";
	Счетчик = 0;
	
	// Домашний телефон
	ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
	ДанныеКИ = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент,ТипКИ,ВидКИ);
	Если ЗначениеЗаполнено(ДанныеКИ) Тогда
		ПрефиксЗаписи = Префикс + "[" + Счетчик + "].";
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@value","ph:" + ДанныеКИ);
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@use","HP");
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
	// Мобильный телефон
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	ДанныеКИ = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент,ТипКИ,ВидКИ);
	Если ЗначениеЗаполнено(ДанныеКИ) Тогда
		ПрефиксЗаписи = Префикс + "[" + Счетчик + "].";
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@value","ph:" + ДанныеКИ);
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@use","MC");
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
	// Рабочий телефон
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
	ДанныеКИ = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент,ТипКИ,ВидКИ);
	Если ЗначениеЗаполнено(ДанныеКИ) Тогда
		ПрефиксЗаписи = Префикс + "[" + Счетчик + "].";
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@value","ph:" + ДанныеКИ);
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@use","WP");
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
	// Электронная почта домашная
	ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
	ДанныеКИ = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент,ТипКИ,ВидКИ);
	Если ЗначениеЗаполнено(ДанныеКИ) Тогда
		ПрефиксЗаписи = Префикс + "[" + Счетчик + "].";
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@value","email:" + ДанныеКИ);
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@use","HP");
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
	// Электронная почта рабочая
	ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
	ДанныеКИ = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Клиент,ТипКИ,ВидКИ);
	Если ЗначениеЗаполнено(ДанныеКИ) Тогда
		ПрефиксЗаписи = Префикс + "[" + Счетчик + "].";
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@value","email:" + ДанныеКИ);
		ДобавитьВМассив(ДанныеЗаполнения,ПрефиксЗаписи + "@use","WP");
		Счетчик = Счетчик + 1;
	КонецЕсли;
	
КонецПроцедуры
 
Процедура СоздатьПакетЗаказаЛабИсследования_ТЧ( ДанныеЗаполнения, Знач Документ, Знач строкаТЗ, Знач Номер )
	
	Услуга = строкаТЗ.Номенклатура;
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.text.table.tbody.tr[" + Строка(Номер-1) + "].@ID","tr-" + Номер);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВнешниеКодыУслугКЛ.Код
	|ИЗ
	|	РегистрСведений.ВнешниеКодыУслугКЛ КАК ВнешниеКодыУслугКЛ
	|ГДЕ
	|	ВнешниеКодыУслугКЛ.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КодЛИС = "";
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КодЛИС = ВыборкаДетальныеЗаписи.Код;
		ДобавитьВМассив(ДанныеЗаполнения,
		"component.structuredBody.component.section.text.table.tbody.tr[" + Строка(Номер-1) + "].td[0]",
		СокрЛП(Строка(ВыборкаДетальныеЗаписи.Код)));
	КонецЕсли;
	
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.text.table.tbody.tr[" + Строка(Номер-1) + "].td[1]",
	Строка(Услуга.Наименование));
	
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.text.table.tbody.tr[" + Строка(Номер-1) + "].td[2]",
	Строка(Документ.Дата));  	
	
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.text.table.tbody.tr[" + Строка(Номер-1) + "].td[3]",
	"");
	
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.@classCode","OBS");
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.@moodCode","RQO");
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.@negationInd",
	"false");
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.id.@root",Строка(Услуга.УникальныйИдентификатор()));
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.id.@extension",Строка(Номер));
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.id[1].@extension",Строка("ПЛТ"));
	
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.code.@code",СокрЛП(Строка(КодЛИС)));
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.code.@displayName",Строка(Услуга.Наименование));
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.text.reference.@value","#tr-" + Номер);
	
	ДобавитьВМассив(ДанныеЗаполнения,
	"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.effectiveTime.@value",Формат(Документ.Дата, "ДФ=yyyyMMddHHmmss"));
	
	// Код пробы может быть не заполнен
	Попытка
		ДобавитьВМассив(ДанныеЗаполнения,
		"component.structuredBody.component.section.entry[" + Строка(Номер-1) + "].observation.specimen[0].specimenRole.id[0].@extension",Строка(строкаТЗ.КодПробы));
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьВМассив(Массив,Ключ,Значение)
	Массив.Добавить(Новый Структура("Ключ,Значение",Ключ,Значение));
КонецПроцедуры

Процедура ЗаполнитьОбъектXDTO(Объект, ДанныеЗаполнения, Фабрика_XDTO = Неопределено) Экспорт
	Для Каждого КлючЗначение Из ДанныеЗаполнения Цикл
		Ключи = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючЗначение.Ключ, ".");
		ТекущийОбъект = Объект;
		ПредыдущийОбъект = Неопределено;
		Для Каждого Ключ Из Ключи Цикл
			ПредыдущийОбъект = ТекущийОбъект;
			Если Не ЭтоАтрибут(Ключ) Тогда
				Если ОбъектСуществует(ТекущийОбъект,Ключ) Тогда
					ТекущийОбъект = ПолучитьОбъектПоля(ТекущийОбъект,Ключ);
				Иначе
					ТекущийОбъект = СоздатьОбъектПоля(ТекущийОбъект, Ключ, Фабрика_XDTO);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекущийОбъект <> Неопределено Тогда
			Если КлючЗначение.Значение <> Неопределено И КлючЗначение.Значение <> "" Тогда
				Если ЭтоАтрибут(Ключ) Тогда
					ТекущийОбъект[ИмяКлюча(Ключ)] = КлючЗначение.Значение;
				Иначе
					ТекущийОбъект.Последовательность().Добавить(КлючЗначение.Значение, Неопределено);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПредыдущийОбъект[ИмяКлюча(Ключ)] = КлючЗначение.Значение;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

Функция СериализоватьОбъектXDTO(ОбъектXDTO, Кодировка = "", Фабрика_XDTO = Неопределено) Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(?(ПустаяСтрока(Кодировка), "UTF-8", Кодировка));
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	Если Фабрика_XDTO = Неопределено Тогда
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	Иначе
		Фабрика_XDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	КонецЕсли;
	Возврат ЗаписьXML.Закрыть();
КонецФункции

Функция СоздатьОбъект_RCMR_IN000002UV02(ТекстДокумента, Фабрика_XDTO = Неопределено) Экспорт
	ДанныеЗаполнения = Новый Массив;
	ДобавитьВМассив(ДанныеЗаполнения,"id.@root",Строка(Новый УникальныйИдентификатор()));
	ДобавитьВМассив(ДанныеЗаполнения,"creationTime.@value",Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss"));
	ДобавитьВМассив(ДанныеЗаполнения,"@ITSVersion","XML_1.0");
	ДобавитьВМассив(ДанныеЗаполнения,"interactionId.@extension","RCMR_IN000002UV02");
	ДобавитьВМассив(ДанныеЗаполнения,"interactionId.@root","2.16.840.1.113883.1.18");
	ДобавитьВМассив(ДанныеЗаполнения,"processingCode.@code","P");
	ДобавитьВМассив(ДанныеЗаполнения,"processingModeCode.@code","T");
	ДобавитьВМассив(ДанныеЗаполнения,"acceptAckCode.@code","AL");
	ДобавитьВМассив(ДанныеЗаполнения,"receiver.@typeCode","RCV");
	ДобавитьВМассив(ДанныеЗаполнения,"receiver.device.@classCode","DEV");
	ДобавитьВМассив(ДанныеЗаполнения,"receiver.device.@determinerCode","INSTANCE");
	ДобавитьВМассив(ДанныеЗаполнения,"receiver.device.id.@nullFlavor","NI");
	ДобавитьВМассив(ДанныеЗаполнения,"sender.@typeCode","SND");
	ДобавитьВМассив(ДанныеЗаполнения,"sender.device.@classCode","DEV");
	ДобавитьВМассив(ДанныеЗаполнения,"sender.device.@determinerCode","INSTANCE");
	ДобавитьВМассив(ДанныеЗаполнения,"sender.device.id.@nullFlavor","NI");
	ДобавитьВМассив(ДанныеЗаполнения,"controlActProcess.@classCode","CACT");
	ДобавитьВМассив(ДанныеЗаполнения,"controlActProcess.@moodCode","EVN");
	ДобавитьВМассив(ДанныеЗаполнения,"controlActProcess.text.@mediaType","multipart/related");
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВремФайл = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	ВремФайл.Записать(ТекстДокумента);
	ВремФайл.Закрыть();
	
	ТелоСообщения = "
	|MIME-Version: 1.0
	|Content-Type: multipart/related; boundary=""HL7-CDA-boundary"";
	|type=""text/xml"";
	|Content-Transfer-Encoding: BASE64
	|
	|--HL7-CDA-boundary
	|Content-Type: text/xml; charset=UTF-8
	|
	|"
	+ Base64Строка(Новый ДвоичныеДанные(ИмяФайла))
	+ "
	|
	|    --HL7-CDA-boundary--
	|";
	
	ДобавитьВМассив(ДанныеЗаполнения,"controlActProcess.text",ТелоСообщения);
	
	Тип_RCMR_IN000002UV02 = ФабрикаXDTO.Тип("urn:hl7-org:v3","RCMR_IN000002UV02");
	СообщениеОбъект = ФабрикаXDTO.Создать(Тип_RCMR_IN000002UV02);
	
	ЗаполнитьОбъектXDTO(СообщениеОбъект, ДанныеЗаполнения, Фабрика_XDTO);
	
	Возврат СообщениеОбъект;
	
КонецФункции

Функция ПолучитьКодПола(ПолСсылка) Экспорт
	Если ПолСсылка = Перечисления.ПолФизическихЛиц.Женский Тогда
		Возврат "F";
	ИначеЕсли ПолСсылка = Перечисления.ПолФизическихЛиц.Мужской Тогда
		Возврат "M";
	ИначеЕсли ПолСсылка = Перечисления.ПолФизическихЛиц.НеУказан Тогда
		Возврат "UN";
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ПолучитьОбъектПоля(Объект, Ключ)
	Если ТипЗнч(Объект[ИмяКлюча(Ключ)]) = Тип("СписокXDTO") Тогда
		Если ЭтоСписок(Ключ) Тогда
			Индекс = ПолучитьИндекс(Ключ);
			Возврат Объект[ИмяКлюча(Ключ)].Получить(Индекс);
		Иначе
			Возврат Объект[ИмяКлюча(Ключ)].Получить(0);
		КонецЕсли;
	Иначе
		Возврат Объект[ИмяКлюча(Ключ)];
	КонецЕсли;
	
КонецФункции

Функция ЭтоАтрибут(Ключ)
	Если Лев(Ключ,1) = "@" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ИмяКлюча(Ключ)
	Если ЭтоАтрибут(Ключ) Тогда
		Возврат ИмяКлюча(Прав(Ключ,СтрДлина(Ключ) - 1));
	ИначеЕсли ЭтоСписок(Ключ) Тогда
		ЧастиКлюча = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключ, "[");
		Возврат ИмяКлюча(ЧастиКлюча[0]);
	ИначеЕсли КлючСодержитТип(Ключ) Тогда
		ЧастиКлюча = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключ, "{");
		Возврат ЧастиКлюча[0];
	Иначе
		Возврат Ключ;
	КонецЕсли;
КонецФункции

Функция ОбъектСуществует(Объект, Ключ)
	Если ТипЗнч(Объект[ИмяКлюча(Ключ)]) = Тип("СписокXDTO") Тогда
		Список = Объект[ИмяКлюча(Ключ)];
		
		Если ЭтоСписок(Ключ) Тогда
			Индекс = ПолучитьИндекс(Ключ);
			Возврат Список.Количество() > Индекс;
		Иначе
			Возврат Список.Количество() <> 0;
		КонецЕсли;
	Иначе
		Возврат Объект[ИмяКлюча(Ключ)] <> Неопределено;
	КонецЕсли;
КонецФункции

Функция СоздатьОбъектПоля(Объект, Ключ, Фабрика_XDTO = Неопределено)
	
	Если КлючСодержитТип(Ключ) Тогда
		ОписаниеТипаXDTO = ПолучитьИмяТипа(Ключ);
		ТипXDTO = ПолучитьТипXDTO(ОписаниеТипаXDTO.ИмяТипа, ОписаниеТипаXDTO.ПространствоИмен, Фабрика_XDTO);
	Иначе
		ТипXDTO = Объект.Тип().Свойства.Получить(ИмяКлюча(Ключ)).Тип;
	КонецЕсли;
	Результат = СоздатьОбъектXDTO(ТипXDTO, Фабрика_XDTO);
	
	Если Результат <> Неопределено Тогда
		Если ТипЗнч(Объект[ИмяКлюча(Ключ)]) = Тип("СписокXDTO") Тогда
			Объект[ИмяКлюча(Ключ)].Добавить(Результат);
		Иначе
			Объект[ИмяКлюча(Ключ)] = Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция КлючСодержитТип(Ключ)
	Возврат Найти(Ключ,"{") <> 0;
КонецФункции

Функция ЭтоСписок(Ключ)
	Если Прав(Ключ,1) = "]" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьИндекс(Ключ)
	ЧастиКлюча = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключ, "[");
	Возврат Число(Лев(ЧастиКлюча[1],СтрДлина(ЧастиКлюча[1])-1));
КонецФункции

Функция ПолучитьИмяТипа(Ключ)
	Лево = Найти(Ключ,"{");
	Право = Найти(Ключ,"}");
	Зпт = Найти(Ключ,",");
	Содержимое = Сред(Ключ,Лево + 1,Право - Лево - 1);
	ПространствоИмен = ВосстановитьПространствоИмен(Лев(Содержимое,Зпт - Лево - 1));
	ИмяТипа = Прав(Содержимое,Право - Зпт - 1);
	Возврат Новый Структура("ПространствоИмен, ИмяТипа", ПространствоИмен, ИмяТипа);
КонецФункции

Функция СоздатьОбъектXDTO(ТипОбъекта, Фабрика_XDTO = Неопределено)
	
	Если Фабрика_XDTO = Неопределено Тогда
		Возврат ФабрикаXDTO.Создать(ТипОбъекта);
	Иначе
		Возврат Фабрика_XDTO.Создать(ТипОбъекта);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипXDTO(ИмяТипа, ПространствоИмен, Фабрика_XDTO = Неопределено)
	
	Если Фабрика_XDTO = Неопределено Тогда
		Возврат ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
	Иначе
		Возврат Фабрика_XDTO.Тип(ПространствоИмен, ИмяТипа);
	КонецЕсли;
	
КонецФункции

Функция ВосстановитьПространствоИмен(ПИ)
	Возврат СтрЗаменить(ПИ,"#<dot>#",".");
КонецФункции

Функция ПолучитьПриемПоЗаказу(Знач Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прием.Ссылка,
	|	ВЫБОР
	|		КОГДА Прием.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Основание = &Заказ
	|	И НЕ Прием.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Прием.Дата УБЫВ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПолучениеРезультатаАнализа // Получение результатов из 1С:Клиническая лаборатория

Функция ОбработатьТекстСообщенияОтЛаборатории(Message) Экспорт
	
	Попытка
		
		ТекстСообщения = ПолучитьТекстВложенногоДокумента(Message);
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ТекстСообщения);
		
		ДокументXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,
		ФабрикаXDTO.Пакеты.Получить("urn:hl7-org:v3").Получить("POCD_MT000040.ClinicalDocument"));
		ГУИДДокумента = Новый УникальныйИдентификатор(ДокументXDTO.Id.Root);
		Документ = Документы.ЗаказНаИсследованиеВнутренний.ПолучитьСсылку(ГУИДДокумента).ПолучитьОбъект();
		
		НомерОт = Найти(ТекстСообщения,"<text>") + 6;
		НомерДо = Найти(ТекстСообщения,"</text>") - 1;
		
		РезультатИсследования = Прав(Лев(ТекстСообщения,НомерДо), СтрДлина(Лев(ТекстСообщения,НомерДо)) - НомерОт);
		
		НомерОт = Найти(ТекстСообщения,"<title>") + 6;
		НомерДо = Найти(ТекстСообщения,"</title>") - 1;
		
		Title = Прав(Лев(ТекстСообщения,НомерДо), СтрДлина(Лев(ТекстСообщения,НомерДо)) - НомерОт);
		
		Если Строка(Message.Тип()) = "{urn:hl7-org:v3}POLB_IN224100UV01" Тогда
			Документ.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.ПолученЧастичныйРезультат;		
		Иначе
			Документ.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.ПолученРезультат;
		КонецЕсли;
		
		Документ.Врач = Документ.ВебСервис.Сотрудник;
		
		Попытка
			УидАнализаСтрока = ДокументXDTO.inFulfillmentOf[0].order.Id[0].Root;
			УидАнализа = Новый УникальныйИдентификатор(УидАнализаСтрока);
		Исключение
			УидАнализа = Неопределено;
		КонецПопытки;
		
		СтрокаИсследования = Неопределено;
		Для Каждого СтрокаИсследованияТек Из Документ.Исследования Цикл
			Если СтрокаИсследованияТек.Ид = УидАнализа
				Или СтрокаИсследованияТек.Номенклатура.УникальныйИдентификатор() = УидАнализа
				Тогда
				СтрокаИсследования = СтрокаИсследованияТек;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		РезультатИсследования = "<p>"+Title+"</p>"+РезультатИсследования;
		ДокументDOM = СоздатьДокументDOMИзHTML(РезультатИсследования);
		РезультатИсследованияHTML = ПолучитьТекстHTMLИзДокументаDOM(ДокументDOM);
		
		СтрокаПеренос = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстHTMLРазрывСтраницы(Ложь);
		
		Если СтрокаИсследования = Неопределено Тогда
			Если ЗначениеЗаполнено(УидАнализа) Тогда
				СтрокаИсследования = Документ.Исследования.Добавить();
				СтрокаИсследования.ИД = УидАнализа;
				СтрокаИсследования.РезультатИсследования = РезультатИсследованияHTML;
			Иначе
				ДокументРезультат = Документ.Результат.Получить();
				Если ЗначениеЗаполнено(ДокументРезультат) Тогда
					ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ДокументРезультат, РезультатИсследованияHTML, СтрокаПеренос, Истина);
				Иначе
					ДокументРезультат = РезультатИсследованияHTML;
				КонецЕсли;
				Документ.Результат = Новый ХранилищеЗначения(ДокументРезультат);
			КонецЕсли;
		Иначе
			СтрокаИсследования.РезультатИсследования = РезультатИсследованияHTML;
		КонецЕсли;
		
		Документ.Записать();
		
		// Создание приема.
		Если Документ.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.ПолученРезультат Тогда
			
			ПриемСсылка = ВзаимодействиеСЛИС.ПолучитьПриемПоЗаказу(Документ.Ссылка);
			
			Если ПриемСсылка <> Неопределено Тогда 
				ПриемОбъект = ПриемСсылка.ПолучитьОбъект();
			Иначе
				ПриемОбъект = Документы.Прием.СоздатьДокумент();
			КонецЕсли;
			
			ПриемОбъект.Дата = ТекущаяДата();
			ПриемОбъект.ДополнительныеСвойства.Вставить("НеДелатьПроверокПриЗаписи", Истина);
			
			Если ЗначениеЗаполнено(УидАнализа) Тогда
				ПредставлениеВсехИсследований = "";
			Иначе
				ПредставлениеВсехИсследований = Документ.Результат.Получить();
				ПредставлениеВсехИсследований = ?(ЗначениеЗаполнено(ПредставлениеВсехИсследований),ПредставлениеВсехИсследований,"");
			КонецЕсли;
			
			Для Каждого СтрокаИсследования Из Документ.Исследования Цикл
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ПредставлениеВсехИсследований, СтрокаИсследования.РезультатИсследования, СтрокаПеренос, Истина);
			КонецЦикла;
			
			Если ПриемОбъект.Проведен Тогда
				ПриемОбъект.Осмотр = ПредставлениеВсехИсследований;
				ПриемОбъект.Записать();
				Документ.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.Обработан;
			Иначе
				ПриемОбъект.Заполнить(Документ.Ссылка);
				ПриемОбъект.Осмотр = ПредставлениеВсехИсследований;
				Попытка
					ПриемОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Документ.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.Обработан;
				Исключение	КонецПопытки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПриемОбъект.Ссылка) Тогда
				УстановитьОтметкиДляДействийПМО(ПриемОбъект.Ссылка, Документ.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
		Документ.Записать();
		
		Результат = ОтправитьОтвет(ДокументXDTO);
		
	Исключение
		Ошибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Сообщение от ЛИС",УровеньЖурналаРегистрации.Ошибка,,,Ошибка);
		Результат = ОтправитьОтвет(ДокументXDTO, Ошибка);
	КонецПопытки;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Результат);
	
	Возврат Результат;
	
КонецФункции 

Процедура УстановитьОтметкиДляДействийПМО(Прием, ЗаказНаИсследование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказВоВнешнююЛабораториюИсследования.Ссылка КАК Ссылка,
		|	ЗаказВоВнешнююЛабораториюИсследования.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ДанныеЗаказовНеобходимыхОбработать
		|ИЗ
		|	Документ.ЗаказНаИсследованиеВнутренний.Исследования КАК ЗаказВоВнешнююЛабораториюИсследования
		|ГДЕ
		|	ЗаказВоВнешнююЛабораториюИсследования.Ссылка = &ЗаказНаИсследование
		|	И ЗаказВоВнешнююЛабораториюИсследования.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрохождениеМедосмотраДействияМедосмотра.Действие КАК Действие,
		|	ПрохождениеМедосмотраДействияМедосмотра.Ссылка КАК СсылкаПМО,
		|	&Прием КАК Прием
		|ИЗ
		|	ДанныеЗаказовНеобходимыхОбработать КАК ДанныеЗаказовНеобходимыхОбработать
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрохождениеМедосмотра.ДействияМедосмотра КАК ПрохождениеМедосмотраДействияМедосмотра
		|		ПО ДанныеЗаказовНеобходимыхОбработать.Ссылка.Клиент = ПрохождениеМедосмотраДействияМедосмотра.Ссылка.Клиент
		|			И ДанныеЗаказовНеобходимыхОбработать.Номенклатура = ПрохождениеМедосмотраДействияМедосмотра.Действие.Номенклатура
		|			И (ПрохождениеМедосмотраДействияМедосмотра.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрохождениеМедосмотраДействияМедосмотра.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("ЗаказНаИсследование", ЗаказНаИсследование);
	Запрос.УстановитьПараметр("Прием", Прием);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МедосмотрыСервер.УстановитьОтметкиДляДействийПМОПоВыборке(Выборка);
	
КонецПроцедуры

Функция ПолучитьТекстВложенногоДокумента(Сообщение) Экспорт
	
	Содержимое = Сообщение.controlActProcess.text;
	Если Содержимое = Неопределено Тогда
		ВызватьИсключение "Атрибут controlActProcess.text пустой";
	КонецЕсли;
	
	Текст = Содержимое.Последовательность().ПолучитьТекст(0);
	Пакет = ПолучитьСодержимоеMIMEПакета(Текст);
	
	Если Пакет.Секции.Количество() = 0 Тогда
		ВызватьИсключение "Вложенное сообщение не найдено";
	КонецЕсли;
	
	ДвоичныеДанные = Base64Значение(Пакет.Секции[0].Тело);
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ИмяФайла);
	
	
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяФайла, "UTF-8");
	Документ = Текст.ПолучитьТекст();

	УдалитьФайлКаталог(ИмяФайла);
	
	Возврат Документ;
	
КонецФункции

Функция ОтправитьОтвет(Документ ,Ошибка = "")
	
	Если Ошибка = "" Тогда 
		Возврат СоздатьОтвет_MCCI_IN000002UV01(Документ, Ложь);
	Иначе
		ДетальОшибки = Новый Структура("ТекстОшибки, location", Ошибка, "");
		ДеталиОшибки = Новый Массив;
		ДеталиОшибки.Добавить(ДетальОшибки);
		Возврат СоздатьОтвет_MCCI_IN000002UV01(Документ, Истина, ДеталиОшибки);
	КонецЕсли;
	
КонецФункции

Функция СоздатьОтвет_MCCI_IN000002UV01(Документ, Ошибка = Ложь, ДеталиОшибки = Неопределено)

	Если Ошибка Тогда
		ТекстОбъектаXDTO = СериализоватьОбъектXDTO(Документ);
		ЗаписьЖурналаРегистрации(
			"Обмены данными с МИС. Получения сообщения от МИС. Сервис HL7v3Exchange ProcessHL7v3Message",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Ошибка в HL7v3Exchange.ProcessHL7v3Message."
			+ Символы.ПС + ТекстОбъектаXDTO
		);
	КонецЕсли;

	Попытка
		Если Документ.acceptAckCode.code = "NE" Тогда
			Возврат Неопределено;
		ИначеЕсли Ошибка = Ложь И Документ.acceptAckCode.code = "ER" Тогда
			Возврат Неопределено;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	СообщенияЗагрузки = "";
	
	Данные = Новый Структура("targetMessageid, AcknowledgementTypeCode, Сообщение, AcknowledgementDetailTypeCode, ДеталиОшибки");
	
	Попытка
		Данные.targetMessageid = Документ.id.root;
	Исключение
	КонецПопытки;
	
	Данные.Сообщение = СообщенияЗагрузки;
	
	Если Ошибка И ДеталиОшибки = Неопределено Тогда
		Данные.AcknowledgementTypeCode = "AE";
		Данные.AcknowledgementDetailTypeCode = "E";
	Иначе
		Данные.AcknowledgementTypeCode = "AA";
		Данные.AcknowledgementDetailTypeCode = "W";
	КонецЕсли;
	
	Данные.Сообщение = СообщенияЗагрузки;
	Данные.ДеталиОшибки = ДеталиОшибки;
	
	Возврат СоздатьОбъект_MCCI_IN000002UV01(Данные);
КонецФункции

Функция ПолучитьСодержимоеMIMEПакета(ТекстСообщения)
	
	Сообщение = Новый ТекстовыйДокумент;
	Сообщение.УстановитьТекст(СокрЛП(ТекстСообщения));
	
	НомерСтроки = 0;
	
	ПропуститьПустыеСтроки(Сообщение, НомерСтроки);
	
	Заголовок = "MIME-Version:"; // 1.0
	ПерваяСтрока = СокрЛП(Сообщение.ПолучитьСтроку(НомерСтроки));
	Если Не ВРег(Лев(ПерваяСтрока, СтрДлина(Заголовок))) = ВРег(Заголовок) Тогда
		ВызватьИсключение "Неправильный заголовок MIME-пакета";
	КонецЕсли;
	
	Пакет = Новый Структура;
	
	// Параметры пакета
	НомерСтроки = НомерСтроки + 1;
	ПараметрыЗаголовка = ПолучитьПараметрыMIMEПакета(Сообщение, НомерСтроки);
	Пакет.Вставить("Параметры", ПараметрыЗаголовка);
	Пакет.Вставить("Секции", Новый Массив);
	
	ТипСодержимого = ПараметрыЗаголовка.Получить("Content-Type");
	Если Не ТипСодержимого = Неопределено Тогда
		Если Не ТипСодержимого.Получить("multipart") = Неопределено Тогда
			РазделительСекций = ТипСодержимого.Получить("boundary");
			Если Не РазделительСекций = Неопределено Тогда
				Секция = ПолучитьСледующуюСекциюMIMEПакета(Сообщение, НомерСтроки, РазделительСекций);
				Пока Не Секция = Неопределено Цикл
					Пакет.Секции.Добавить(Секция);
					Секция = ПолучитьСледующуюСекциюMIMEПакета(Сообщение, НомерСтроки, РазделительСекций);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Пакет;
	
КонецФункции

Процедура УдалитьФайлКаталог(ИмяФайлаКаталога) Экспорт
	
	УдаляемыйОбъект = Новый Файл(ИмяФайлаКаталога);
	
	Если УдаляемыйОбъект.Существует() Тогда
		УдалитьФайлы(ИмяФайлаКаталога);
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьОбъект_MCCI_IN000002UV01(Данные)
	
	ТипMCCI_IN000002UV01 = ТипHL7("MCCI_IN000002UV01");
	ТипИД = ТипHL7("II");
	ТипДата = ТипHL7("TS");
	ТипКод = ТипHL7("CS");
	
	СообщениеОбъектXDTO = СоздатьОбъектXDTO(ТипMCCI_IN000002UV01);
	
	СообщениеОбъектXDTO.id = СоздатьОбъектXDTO(ТипИД);
	СообщениеОбъектXDTO.id.root = Строка(Новый УникальныйИдентификатор);
	
	СообщениеОбъектXDTO.interactionId = СоздатьОбъектXDTO(ТипИД);
	СообщениеОбъектXDTO.interactionId.root = "2.16.840.1.113883.1.18";
	СообщениеОбъектXDTO.interactionId.extension = "MCCI_IN000002UV01";
		
	СообщениеОбъектXDTO.creationTime = СоздатьОбъектXDTO(ТипДата);
	СообщениеОбъектXDTO.creationTime.value = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
	
	СообщениеОбъектXDTO.processingCode = СоздатьОбъектXDTO(ТипКод);
	СообщениеОбъектXDTO.processingCode.code = "P";
	
	СообщениеОбъектXDTO.processingModeCode = СоздатьОбъектXDTO(ТипКод);
	СообщениеОбъектXDTO.processingModeCode.code = "T";
	
	СообщениеОбъектXDTO.acceptAckCode = СоздатьОбъектXDTO(ТипКод);
	СообщениеОбъектXDTO.acceptAckCode.code = "NE";
	
	ТипПолучателя = ТипMCCI_IN000002UV01.Свойства.Получить("receiver").Тип;
	ТипУстройства = ТипПолучателя.Свойства.Получить("device").Тип;
	Получатель = СоздатьОбъектXDTO(ТипПолучателя);
	Получатель.typeCode = "RCV";
	Получатель.device = СоздатьОбъектXDTO(ТипУстройства);
	Получатель.device.classCode = "DEV";
	Получатель.device.determinerCode = "INSTANCE";
	Получатель.device.id.Добавить(СоздатьОбъектXDTO(ТипИД));
	Получатель.device.id[0].nullflavor = "NI";
	
	СообщениеОбъектXDTO.receiver.Добавить(Получатель);
	
	ТипОтправителя = ТипMCCI_IN000002UV01.Свойства.Получить("sender").Тип;
	ТипУстройства = ТипОтправителя.Свойства.Получить("device").Тип;
	Отправитель = СоздатьОбъектXDTO(ТипОтправителя);
	Отправитель.typeCode = "SND";
	Отправитель.device = СоздатьОбъектXDTO(ТипУстройства);
	Отправитель.device.classCode = "DEV";
	Отправитель.device.determinerCode = "INSTANCE";
	Отправитель.device.id.Добавить(СоздатьОбъектXDTO(ТипИД));
	Отправитель.device.id[0].nullflavor = "NI";
	
	СообщениеОбъектXDTO.sender = Отправитель;
	
	ТипТелоСообщенияЗагрузки = ТипMCCI_IN000002UV01.Свойства.Получить("acknowledgement").Тип;
	ТипИсходноеСообщение = ТипТелоСообщенияЗагрузки.Свойства.Получить("targetMessage").Тип;
	
	ТелоСообщенияЗагрузки = СоздатьОбъектXDTO(ТипТелоСообщенияЗагрузки);
	СообщениеОбъектXDTO.acknowledgement.Добавить(ТелоСообщенияЗагрузки);
	
	ТелоСообщенияЗагрузки.typeCode = Данные.AcknowledgementTypeCode;
	ТелоСообщенияЗагрузки.targetMessage = СоздатьОбъектXDTO(ТипИсходноеСообщение);
	ТелоСообщенияЗагрузки.targetMessage.id = СоздатьОбъектXDTO(ТипИД);
	ТелоСообщенияЗагрузки.targetMessage.id.root = Строка(Данные.targetMessageid);
	
	Если Данные.Свойство("Сообщение") И ЗначениеЗаполнено(Данные.Сообщение) Тогда
		
		ТипДетали = ТипТелоСообщенияЗагрузки.Свойства.Получить("acknowledgementDetail").Тип;
		Детали = СоздатьОбъектXDTO(ТипДетали);
		ТелоСообщенияЗагрузки.acknowledgementDetail.Добавить(Детали);
		Детали.typeCode = Данные.AcknowledgementDetailTypeCode;
		Детали.text = СоздатьОбъектXDTO(ТипHL7("ED"));
		Детали.text.Последовательность().Добавить(Данные.Сообщение, Неопределено);
		
	КонецЕсли;
	
	Если Данные.Свойство("ДеталиОшибки") И Данные.ДеталиОшибки <> Неопределено Тогда
		ТипДетали = ТипТелоСообщенияЗагрузки.Свойства.Получить("acknowledgementDetail").Тип;
		Для Каждого ДанныеОшибки Из Данные.ДеталиОшибки Цикл
			Детали = СоздатьОбъектXDTO(ТипДетали);
			ТелоСообщенияЗагрузки.acknowledgementDetail.Добавить(Детали);
			Детали.typeCode = "E";
			Детали.text = СоздатьОбъектXDTO(ТипHL7("ED"));
			Детали.text.Последовательность().Добавить(ДанныеОшибки.ТекстОшибки, Неопределено);
			
			ШаблонИдентификатора = СоздатьОбъектXDTO(ТипHL7("II"));
			ШаблонИдентификатора.extension = "LabResultStatus";
			Детали.templateId.Добавить(ШаблонИдентификатора);

			Location = СоздатьОбъектXDTO(ТипHL7("ST"));
			Детали.location.Добавить(Location);
			Детали.location[0].Последовательность().Добавить(ДанныеОшибки.location, Неопределено);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СообщениеОбъектXDTO;
	
КонецФункции

Процедура ПропуститьПустыеСтроки(Сообщение, НомерСтроки)
	
	КоличествоСтрок = Сообщение.КоличествоСтрок();
	Пока НомерСтроки <= КоличествоСтрок И ПустаяСтрока(Сообщение.ПолучитьСтроку(НомерСтроки)) Цикл
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПараметрыMIMEПакета(Сообщение, НомерСтроки)
	
	ИмяПараметра = "";
	ПараметрыЗаголовка = Новый Соответствие;
	КоличествоСтрок = Сообщение.КоличествоСтрок();
	Пока НомерСтроки <= КоличествоСтрок И Не ПустаяСтрока(Сообщение.ПолучитьСтроку(НомерСтроки)) Цикл
		
		СтрокаПараметра = СокрЛП(Сообщение.ПолучитьСтроку(НомерСтроки));
		Если СледующийПараметр(СтрокаПараметра) Тогда
			ИмяПараметра = ИмяMIMEПараметра(СтрокаПараметра);
			ПараметрыЗаголовка.Вставить(ИмяПараметра, Новый Соответствие);
			СтрокаПараметра = СокрЛП(Сред(СтрокаПараметра, СтрДлина(ИмяПараметра) + 2));
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяПараметра) Тогда
			ВызватьИсключение "Ошибочный формат параметров";
		КонецЕсли;
		
		ЗначенияПараметра = ПараметрыЗаголовка.Получить(ИмяПараметра);
		ЗначенияПараметраСтрокой = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметра, ";");
		Для Каждого ЗначениеПараметра Из ЗначенияПараметраСтрокой Цикл
			Если ПустаяСтрока(ЗначениеПараметра) Тогда
				Продолжить;
			КонецЕсли;
			Значение = СокрЛП(ЗначениеПараметра);
			ПозицияРазделителя = Найти(Значение, "=");
			Если ПозицияРазделителя = 0 Тогда
				ПозицияРазделителя = Найти(Значение, "/");
			КонецЕсли;
			Если ПозицияРазделителя Тогда
				ЗначенияПараметра.Вставить(
					СокрЛП(Лев(Значение, ПозицияРазделителя - 1)),
					УдалитьКавычки(СокрЛП(Сред(Значение, ПозицияРазделителя + 1))));
			Иначе
				ЗначенияПараметра.Вставить(Значение, "");
			КонецЕсли;
		КонецЦикла;		
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат ПараметрыЗаголовка;
	
КонецФункции

Функция ПолучитьСледующуюСекциюMIMEПакета(Сообщение, НомерСтроки, РазделительСекций)
	
	ПропуститьПустыеСтроки(Сообщение, НомерСтроки);
	
	Если НомерСтроки > Сообщение.КоличествоСтрок() Тогда
		ВызватьИсключение "Неожиданный конец сообщения";
	КонецЕсли;
	
	НачалоСекции = "--" + РазделительСекций;
	КонецСекций =  "--" + РазделительСекций + "--";
	
	ПерваяСтрока = СокрЛП(Сообщение.ПолучитьСтроку(НомерСтроки));
	Если Не ВРег(Лев(ПерваяСтрока, СтрДлина(НачалоСекции))) = ВРег(НачалоСекции) Тогда
		ВызватьИсключение "Неправильный разделитель MIME-пакета";
	КонецЕсли;
	
	Если ВРег(Лев(ПерваяСтрока, СтрДлина(КонецСекций))) = ВРег(КонецСекций) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерСтроки = НомерСтроки + 1;
	ПараметрыСекции = ПолучитьПараметрыMIMEПакета(Сообщение, НомерСтроки);
	
	ТелоСообщения = "";
	НомерСтроки = НомерСтроки + 1;
	КоличествоСтрок = Сообщение.КоличествоСтрок();
	Пока НомерСтроки < КоличествоСтрок И Не ПустаяСтрока(Сообщение.ПолучитьСтроку(НомерСтроки)) Цикл
		СтрокаСообщения = Сообщение.ПолучитьСтроку(НомерСтроки);
		ТелоСообщения = ?(ПустаяСтрока(ТелоСообщения), "", ТелоСообщения + Символы.ПС) + СокрЛП(СтрокаСообщения);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Секция = Новый Структура;
	Секция.Вставить("Параметры", ПараметрыСекции);
	Секция.Вставить("Тело", ТелоСообщения);
	
	Возврат Секция;
	
КонецФункции

Функция СледующийПараметр(СтрокаПараметра)
	Возврат Найти(СтрокаПараметра, ":") > 0;
КонецФункции

Функция ИмяMIMEПараметра(СтрокаПараметра)
	Возврат СокрЛП(Лев(СтрокаПараметра, Найти(СтрокаПараметра, ":") - 1));
КонецФункции

Функция УдалитьКавычки(Знач ЗначениеРеквизита)
	
	Если Лев(ЗначениеРеквизита, 1) = """" И Прав(ЗначениеРеквизита, 1) = """" Тогда
		ЗначениеРеквизита = Сред(ЗначениеРеквизита, 2, СтрДлина(ЗначениеРеквизита) - 2);
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

Функция ТипHL7(ИмяТипа, Фабрика_XDTO = Неопределено)
	
	ПространствоИмен = "urn:hl7-org:v3";
	
	Возврат ПолучитьТипXDTO(ИмяТипа, ПространствоИмен, Фабрика_XDTO);

КонецФункции

#Область Работа_С_DOM // Работа с HTML через DOM модель.

Функция СоздатьДокументDOMИзHTML(ТекстHTML) Экспорт
  
  ДокШаблон = Новый ЧтениеHTML;
  ДокШаблон.УстановитьСтроку(ТекстHTML);
  ПостроительDOM = Новый ПостроительDOM;
  HTMLДокумент = ПостроительDOM.Прочитать(ДокШаблон);
  
  Возврат HTMLДокумент;
  
КонецФункции

Функция ПолучитьТекстHTMLИзДокументаDOM(ДокументDOM) Экспорт
  
  ЗаписьDOM = Новый ЗаписьDOM;
  ЗаписьHTML = Новый ЗаписьHTML;
  ЗаписьHTML.УстановитьСтроку();
  ЗаписьDOM.Записать(ДокументDOM, ЗаписьHTML);
  ТекстHTML = ЗаписьHTML.Закрыть();
  
  Возврат ТекстHTML;
  
КонецФункции

#КонецОбласти

#КонецОбласти
